using Microsoft.AspNetCore.Http;
using Microsoft.AspNetCore.Mvc;

namespace angularService.Controllers
{
    [Route("api/[controller]")]
    [ApiController]
    public class RecipeController : ControllerBase
    {
        Category c=new Category();

        public static List<Recipe> recipes = new List<Recipe>()
        {
new Recipe
{
    Code = 0,
    Name = "אלפחורס",
    Category =new Category{Code=3,Icon="../assets/icon3.png",Name="עוגות"},
    Preparation_time = 100,
    Level_of_difficulty = 5,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string> {
    "חמאה - 250 גרם, בטמפרטורת החדר",
    "סוכר לבן - 1/2 כוס",
    "סוכר חום - 1/2 כוס",
    "ביצה - 1",
    "תמצית וניל - 1 כפית",
    "קמח - 2 1/4 כוסות",
    "קוקוס מקולף - 1/2 כוס",
    "אגוזי מלך קצוצים דק - 1/2 כוס",
    "שוקולד שברים - 1/2 כוס",
    "ריבת חלב - למילוי"
},

        Instructions= new List<string> {
    "מחממים תנור ל-180 מעלות צלזיוס ומכסים תוך כדי גזירת העוגיות.",
    "בקערה גדולה, מערבבים את החמאה, הסוכר הלבן והסוכר החום עד שהתערובת ישיגה טקסטורה אוורירית וקרמית.",
    "מוסיפים את הביצה ואת תמצית הווניל, ומערבבים היטב עד שהתערובת מתמזגת.",
    "מוסיפים את הקמח לקרמה ומערבבים עד שהוא מתמזג לתערובת.",
    "מוסיפים את הקוקוס המקולף, את האגוזים הקצוצים ושברי השוקולד לתערובת ומערבבים היטב עד שהם מפוזרים באופן אחיד.",
    "יוצרים כדורים בגודל של כפית וחצי ומסדרים אותם במרחקים של כ-5 ס\"מ בין כל עוגיה על גבי תבנית אפייה מרופדת בנייר אפייה.",
    "עוברים על קצה הכף או אצבע ומשנים קצת ממרוץ העוגיה ומורידים כמה טיפות של ריבת החלב באמצע.",
    "אופים בתנור מחומם למשך כ-10-12 דקות או עד שהעוגיות מתקבלות בצבע זהוב עץ.",
    "מוציאים מהתנור ומניחים להן להתקרר על גבי משטח מקיף לפני הגשה."
},


        Code_Chef = 4,
    Picture_Recipe = "../assets/m1.jpg"
},
new Recipe
{
    Code=1,
    Name = "תבשיל פטריות ",
    Category = new Category(1, "בשרי", "../assets/icon5.png"),
    Preparation_time = 30,
    Level_of_difficulty = 2,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string>
    {
        "500 גרם פטריות (ניתן להשתמש בפטריות חורף או פטריות שמיניות)",
        "2 בטטות, קלופות וחתוכות לקוביות גדולות",
        "1 ראש ברוקולי, מפורק לקושקושים קטנים",
        "2 פלפלים צהובים או אדומים, קצוצים לקוביות קטנות",
        "3-4 שיני שום, כתושות",
        "1 בצל קטן, קצוץ דק",
        "קמצוץ פטרוזיליה טרייה, קצוץ דק",
        "מלח ופלפל שחור לפי הטעם",
        "שמן זית לסירוגין"
    },
    Instructions = new List<string>
    {
        "במחבת גדולה, החממת שמן זית על אש בינונית.",
        "הוספת שום ובצל, וטיגון עד שהם מזהיבים.",
        "הוספת הפטריות ובישולן עד שהן מתרככות ומשנות צבע.",
        "הוספת הבטטות ובישולן עוד כמה דקות עד שהן מתרככות ומתרככות.",
        "הוספת הברוקולי, הפלפלים והפטרוזיליה ובישולם עוד כמה דקות עד שהירקות מתרככים ומתרככים.",
        "תיבול במלח ופלפל שחור לפי הטעם.",
        "צפייה בתבשיל עם שמן זית נוסף וקמצוץ פטרוזיליה טרייה קצוצה לתוספת צבע וטעם.",
        "הגשה חמה כתוספת למנה ראשית או כתבשיל ראשון."
    },
     Code_Chef = 111,
     Picture_Recipe = "../assets/s2.jpg"
},
new Recipe
{
    Code = 2,
    Name = "טארטל תות וקרם קצפת",
    Category =new Category{Code=3,Icon="../assets/icon3.png",Name="עוגות"},
    Preparation_time = 45,
    Level_of_difficulty = 3,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string> {
        "בסיס טארט או פאי - קנוי מהסופרמרקט או עשו בעצמכם",
        "תותים - 500 גרם, נקיים וקפואים",
        "קרם קצפת - 200 מ\"ל",
        "סוכר דק - 1/2 כוס",
        "חלב - 1/2 כוס",
        "קמח תופח - 2 כפות גדושות",
        "ביצה - 1",
        "חמאה - 50 גרם, לטיגון"
    },
    Instructions = new List<string> {
        "שטוף את התותים הקפואים והשאירו להם להתפטר בקרר.",
        "להכין את הקרם: בסיר קטן, שים את החלב והסוכר והמסת.",
        "הקפידו לטגון בעד 5-4 דקות עד שהקרם עמיד.",
        "הוציאו מהלהבה, הוסיפו את קמח התופח והביצה והחליטו את הקרם.",
        "שים בקערה מקררת וכיסו בפלסטיק למגע עם החלק העליון.",
        "הכינו את הבסיס הטארט: לפני הצפיה, חמם את התנור ל-180 מעלות.",
        "בקערה, טחנו חמאה עם קוביות הפרייה של הבסיס.",
        "גלגלו את הבסיס עם השפה עד שהוא מתוחם בתבנית, משווו את הצדדים.",
        "טפחו את השפה בעל הפייה על הקצוות של הבסיס על מנת ליצור תוף.",
        "אפשרו לטארטל להתקרר במקרר לפחות חצי שעה.",
        "הוציאו את הקרם מהמקרר וצפו את התותים על הבסיס.",
        "טפל את התותים עם הקרם וצפה בשכבה אחידה על הגבה."
    },
    Code_Chef = 4,
    Picture_Recipe = "../assets/a18.jpg",
},
new Recipe
{
    Code = 3,
    Name = "סטיר פרי צמחוני",
    Category = new Category{Code=2,Icon="../assets/icon2.png",Name="מרקים"},


    Preparation_time = 30,
    Level_of_difficulty = 2,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string> { "טופו", "ברוקולי", "גזר", "רוטב סויה" },
    Instructions = new List<string> { "טגן ירקות", "הוסף טופו ורוטב סויה", "טגן עד שהכל בשרירות" },
    Code_Chef = 3,
    Picture_Recipe = "../assets/a20.jpg"
},
new Recipe
{
    Code =4,
    Name = "מאפינס קצפת",
    Category =new Category{Code=3,Icon="../assets/icon3.png",Name="עוגות"},
    Preparation_time = 20,
    Level_of_difficulty = 2,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string>
    {
        "2 כוסות קמח לבן",
        "2/3 כוס סוכר לבן",
        "2 כפות אבקת אפייה",
        "1/2 כפית מלח",
        "3/4 כוס חלב",
        "1/4 כוס שמן",
        "1 ביצה",
        "1 כפית תמצית וניל",
        "קצפת עבה לציפוי"
    },
    Instructions = new List<string>
    {
        "חממו את תנור ל-180 מעלות צלסיוס (350 פרנהייט).",
        "משלבים בקערה את הקמח, הסוכר, אבקת האפייה והמלח.",
        "מוסיפים את החלב, השמן, הביצה ותמצית הוניל לתערובת ומערבבים עד שהיא חלקה.",
        "ממלאים כוסות מאפין ב-3/4 מהתערובת.",
        "מאפים בתנור מחומם למשך כ-18-20 דקות או עד שהמאפינס מתייצבים ומשוקעים.",
        "משאירים להם להתקרר מעט ואז מצפים בקצפת עבה."
    },
    Code_Chef = 3,
    Picture_Recipe = "../assets/a17.jpg",
},
new Recipe
{
    Code = 5,
    Name = "עוף ותפוא שלמים",
    Category = new Category(1, "בשרי", "../assets/icon5.png"),
    Preparation_time = 15,
    Level_of_difficulty = 3,
    Date_Add_Recipe = DateTime.Now.Date,
  Products = new List<string> {
 "עוף שלם - אפשר להשתמש בעוף שלם טרי או קפוא. ניתן לבחור בעוף טרי כדי לקבל את הטעם הטוב ביותר או להשתמש בעוף קפוא לנוחות ולשמירה ארוכת טווח.",
    "תפו\"א - כמות לפי הטעם האישי, ניתן להשתמש בתפו\"א שלם או לקטף תפוחי אדמה קטנים. ניתן להשתמש בתפו\"א שלם לטעם עשיר יותר או לבחור בתפוחי אדמה קטנים לנוחות ולמראה יפהפה של המנה.",
    "ירק ירוק - עלים ירוקים טריים ונקיים, כמות לפי הטעם האישי. ניתן להשתמש במגוון של ירקות ירוקים כמו פסטינה, תרד, סלק ספינך ועוד.",
    "תבלינים - מעט שום כתוש, פלפל שחור, מלח, פפריקה, כורכום וכדומה. ניתן להוסיף תבלינים ותיבולים לפי הטעם האישי ולהתאים אותם לסגנון האוכל שמוכנה.",
    "שמן זית - לציפוי וטיגון. שמן זית מומלץ לשימוש בציפוי וטיגון כדי להבטיח טעם עשיר וקרמי למנה."
},

Instructions = new List<string> {
    "חממת תנור ל-180 מעלות צלזיוס.",
    "מקפלים את התפו\"א בנייר אפייה ומניחים בתבנית אפייה.",
    "מניחים את העוף בתוך התפו\"א ומצפים אותו בשמן זית ותבלינים מכל הצדדים.",
    "אופים בתנור מוקפץ למשך כ-45-60 דקות, או עד שהעוף מתייבש והופך לזהוב וקריספי.",
    "מוציאים את העוף מהתנור ומשרים אותו בתפו\"א לכ-10 דקות לקרם נוסף ושימור חום.",
    "מגישים עם ירק ירוק טרי ומגarniruה המוכנים."
},
        Code_Chef = 2,
    Picture_Recipe = "../assets/a (2).jpg"
},
new Recipe
{
    Code = 6,
    Name = "מניפות תפוחי אדמה",
    Category = new Category(1, "לחמים ", "../assets/pizza.png"),
    Preparation_time = 8,
    Level_of_difficulty = 2,
    Date_Add_Recipe = DateTime.Now.Date,

    Products = new List<string> {
    "תפו\"א שלמים - 4-6 תפו\"א בגודל בינוניים",
    "חתיכות בצל - 2-3 בצלים גדושים, חתוכים לרבעים או לחציים",
    "עלי בזיליקום - כמה עלים טריים לקישוט",
    "שמן זית - כמות רחבה לציפוי",
    "מלח ים גס - לטעם",
    "פלפל שחור טחון - לטעם"
},

     Instructions = new List<string> {
 "מחממים תנור לחום של 200 מעלות צלזיוס. חשוב להקפיד על חום תנור נכון כדי להבטיח את ההכנה המוצלחת של התפוחי אדמה.",
    "מניחים את תפוחי האדמה השלמים בתבנית אפייה ומקפיאים אותם על פני פרוסת בצל. כך יהיה קל יותר לפרוס אותם והם יתבשלו באופן אחיד.",
    "מזלים שמן זית על תפוחי האדמה השלמים ומפזרים עליהם קורט מלח ים גס ופלפל שחור טחון לפי הטעם.",
    "אופים בתנור חם למשך כ-40-50 דקות, עד שהתפוחי אדמה מתרככים והגבינה מתזוגגת וצהובה.",
    "מוציאים מהתנור ומפזרים עלי בזיליקום טריים לתיבול נוסף וטעם עשיר יותר.",
    "מגישים חם או קר. יש להנות מהפרוסה הנפלאה ככל שהיא!"
},

        Code_Chef = 3,
    Picture_Recipe = "../assets/a (3).jpg"
},
new Recipe
{
    Code = 7,
    Name = "סלט אבוקודו טעים",
    Category = new Category(1, "סלטים", "../assets/icon4.png"),
    Preparation_time = 10,
    Level_of_difficulty = 1,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string> {
    "אבוקדו - 2 אבוקדואים רכים ובשלים, קלופים ומעוךים",
    "בצל ירוק - 1 בצל ירוק גדול, קצוץ לחתיכות דקות",
    "פלפלים - מעט פלפלים חריפים קצוצים דק",
    "מלח ופלפל לפי הטעם",
    "שמן זית - לציפוי ולתיבול"
},
Instructions = new List<string> {
   "בקערה גדולה, מערבבים את האבוקדו המעוך עם הבצל הירוק והפלפלים. יש להבטיח שהאבוקדו מעוך באופן אחיד כדי להשיג טקסטורה רכה ומאוזנת בסלט.",
    "מוסיפים מלח ופלפל לפי הטעם. מומלץ להתחיל בהוספת כמות קטנה של מלח ופלפל ולטעום, ולהוסיף עוד אם נדרש עד להשגת הטעם הרצוי.",
    "מזינים שמן זית ומערבבים היטב עד שהסלט מתקבל. כדי להשיג את הטעם הטוב ביותר, מומלץ להשתמש בשמן זית כתית ואיכותי.",
    "מגישים מיד או מקררים להגשה מאוחרת. כדי לשמור על טריות הסלט, מומלץ להגישו מיד או לקררו במקרר לזמן קצר לפני ההגשה."
},

        Code_Chef = 4,
    Picture_Recipe = "../assets/a (4).jpg"
},
new Recipe
{
    Code = 8,
    Name = "סלט חסה עשיר",
    Category = new Category(2, "סלטים", "../assets/a (5).png"),
    Preparation_time = 12,
    Level_of_difficulty = 2,
    Date_Add_Recipe = DateTime.Now.Date,
    Products = new List<string> { "חסה - מנה גדולה של עלים ירוקים טריים ונקיים.", "עגבניות שרי - כמה עלי עגבניות שרי, מושטים בחצייתם או חתוכים לחציים", "קוביות גבינה מלוחה - כמה קוביות גבינה מלוחה, כמות לפי הטעם האישי", "כוביה - מקוביים קצת של כוביה לתוספת צבע וטעם","תוספות (אופציונלי)", "זיתים שחורים או ירוקים, מקולפים וחתוכים לחצי או לעיגולים.", "בצל סגול, חתוך לקצוצות דקות" ,"חרדל, רוטב בלסמי, זיתים ממולאים, וכדומה"},
    Instructions = new List<string> {
    "שטוף היטב את החסה ויבש את העלים. לאחר השטיפה, מומלץ לנקות ולייבש היטב את עלי החסה על מגבת נייר כדי להסיר כל רטיבות שעשויה להשאר עליהם.",
    "בקערה גדולה, מערבבים את החסה, עגבניות השרי והקוביות של הגבינה המלוחה. לקרם ולגוף בסלט, מומלץ להוסיף קוביות עגבניות השרי טריות ורעננות כדי להבטיח טעם רענן וקרקפתי.",
    "מוסיפים את התוספות לפי הרצון והטעם האישי. ניתן להוסיף תפוחי עץ קצוצים, אגוזי מלך קצוצים, או חמוציות חתוכות לקרם צבעוני וטעים יותר.",
    "רטב: בקערה קטנה מערבבים יחד חלקים שווים של חרדל, רוטב בלסמי וזיתים ממולאים. מוסיפים את הרטב לסלט ומערבבים היטב עד שכל התוכן מכוסה ברטב.",
    "מגישים או מקררים להגשה מאוחרת. לקרם טעימות מרובות, מומלץ להשאיר את הסלט במקרר לכשעה לפחות לפני ההגשה, כך שהטעמים יתמזגו יחד והסלט ייחשב טעים ומזין יותר."
},

    Code_Chef = 2,
    Picture_Recipe = "../assets/a (5).jpg"
},
};

        // GET: api/<UserController>
        [HttpGet]
        public List<Recipe> Get()
        {
            return recipes;
        }

        //GET api/<UserController>/5
        [HttpGet("{id}")]
        public Recipe Get(int id)
        {
            return recipes.Find(x => x.Code==id);
        }

        // POST api/<UserController>
        [HttpPost]
        public void Post([FromBody] Recipe recipe)
        {
            recipes.Add(recipe);
        }

        // PUT api/<UserController>/5
        [HttpPut("{id}")]
        public void Put(int id, [FromBody] Recipe recipe)
        {
            Recipe r = recipes.Find(x => x.Code == id);
            r.Level_of_difficulty = recipe.Level_of_difficulty;
            r.Picture_Recipe = recipe.Picture_Recipe;
            r.Code=r.Code;
            r.Code_Chef= recipe.Code_Chef;
            r.Products = recipe.Products;
            r.Category = recipe.Category;   
            r.Instructions = recipe.Instructions;   
            r.Date_Add_Recipe = recipe.Date_Add_Recipe; 
            r.Name = recipe.Name;
            r.Preparation_time = recipe.Preparation_time;
        }

        // DELETE api/<UserController>/5
        [HttpDelete("{id}")]
        public void Delete(int id)
        {
            Recipe r = recipes.Find(x => x.Code == id);
            recipes.Remove(r);
        }
    }
}

  
